zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_freertos_helpers.c
/***********************************************************************************************//**
 * \file cyabs_freertos_helpers.c
 *
 * \brief
 * Provides implementations for functions required to enable static allocation and
 * tickless mode in FreeRTOS.
 *
 ***************************************************************************************************
 * \copyright
 * (c) 2019-2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG.  SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/
#include "FreeRTOS.h"
#include "task.h"
#include "cyabs_rtos.h"
#include "cy_utils.h"
#if defined(CY_USING_HAL)
#include "cyhal.h"
#elif defined(COMPONENT_MTB_HAL)
#include "mtb_hal.h"
#define cyhal_system_critical_section_enter() mtb_hal_system_critical_section_enter()
#define cyhal_system_critical_section_exit(x) mtb_hal_system_critical_section_exit(x)
#endif

// This is included to allow the user to control the idle task behavior via the configurator
// System->Power->RTOS->System Idle Power Mode setting.
#include "cybsp.h"

#if (configUSE_TICKLESS_IDLE != 0)
uint32_t cyabs_rtos_get_deepsleep_latency(void);
#endif
uint32_t cyabs_rtos_get_sleep_latency(void);

#if (configUSE_TICKLESS_IDLE != 0)
// By default, the device will deep-sleep in the idle task unless if the device
// configurator overrides the behavior to sleep in the System->Power->RTOS->System
// Idle Power Mode setting.
    #if defined(CY_CFG_PWR_MODE_DEEPSLEEP) && \
    (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP)
        #define ABS_RTOS_DEEPSLEEP_ENABLED
    #elif (defined(CY_CFG_PWR_MODE_DEEPSLEEP_RAM) && \
    (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_DEEPSLEEP_RAM)) || \
    (defined(CY_CFG_PWR_MODE_HIBERNATE_RAM) && \
    (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_HIBERNATE_RAM))
// We don't care here about the difference between deep-sleep and deep-sleep RAM
        #define ABS_RTOS_DEEPSLEEP_ENABLED
    #elif (defined(CY_CFG_PWR_MODE_SLEEP) && (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_SLEEP))
        #define ABS_RTOS_SLEEP_ENABLED
    #endif // if defined(CY_CFG_PWR_MODE_DEEPSLEEP) && (CY_CFG_PWR_SYS_IDLE_MODE ==
// CY_CFG_PWR_MODE_DEEPSLEEP)
// We can support sleep in a non-tickless fashion if there is no LPTimer.
// But we must have it for DeepSleep because the overhead of entering and
// exiting DeepSleep is too high to do so in a tickful fashion.
    #if defined(ABS_RTOS_DEEPSLEEP_ENABLED)
    #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
        #if !(defined(MTB_HAL_DRIVER_AVAILABLE_SYSPM)) || (MTB_HAL_DRIVER_AVAILABLE_SYSPM == 0)
            #error "Tickless idle depends on the SysPm HAL driver, but it is not available"
        #endif
    #else
       #if !(defined(CYHAL_DRIVER_AVAILABLE_SYSPM)) || (CYHAL_DRIVER_AVAILABLE_SYSPM == 0)
           #error "Tickless idle depends on the SysPm HAL driver, but it is not available"
       #endif
    #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)

    #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
       #if !(defined(MTB_HAL_DRIVER_AVAILABLE_LPTIMER)) || (MTB_HAL_DRIVER_AVAILABLE_LPTIMER == 0)
                #error "Tickless idle depends on the LPTimer HAL driver, but it is not available"
        #endif
    #else
        #if !(defined(CYHAL_DRIVER_AVAILABLE_LPTIMER)) || (CYHAL_DRIVER_AVAILABLE_LPTIMER == 0)
            #error "Tickless idle depends on the LPTimer HAL driver, but it is not available"
        #endif
    #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
    #endif // defined(ABS_RTOS_DEEPSLEEP_ENABLED)

    #if defined(ABS_RTOS_DEEPSLEEP_ENABLED) || defined(ABS_RTOS_SLEEP_ENABLED)
    #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
        #if (defined(MTB_HAL_DRIVER_AVAILABLE_SYSPM) && (MTB_HAL_DRIVER_AVAILABLE_SYSPM)) && \
    (defined(MTB_HAL_DRIVER_AVAILABLE_LPTIMER) && (MTB_HAL_DRIVER_AVAILABLE_LPTIMER))
            #define ABS_RTOS_TICKLESS_ENABLED
        #endif
    #else
        #if (defined(CYHAL_DRIVER_AVAILABLE_SYSPM) && (CYHAL_DRIVER_AVAILABLE_SYSPM)) && \
    (defined(CYHAL_DRIVER_AVAILABLE_LPTIMER) && (CYHAL_DRIVER_AVAILABLE_LPTIMER))
            #define ABS_RTOS_TICKLESS_ENABLED
        #endif
    #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
    #endif // if defined(ABS_RTOS_DEEPSLEEP_ENABLED) || defined(ABS_RTOS_SLEEP_ENABLED)
#endif // if (configUSE_TICKLESS_IDLE != 0)

#ifndef pdTICKS_TO_MS
#define pdTICKS_TO_MS(xTicks)    ( ( ( TickType_t ) ( xTicks ) * 1000u ) / configTICK_RATE_HZ )
#endif

#if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
#if defined(MTB_HAL_DRIVER_AVAILABLE_LPTIMER) && (MTB_HAL_DRIVER_AVAILABLE_LPTIMER)
static mtb_hal_lptimer_t* lptimer = NULL;

#if defined(CY_CFG_PWR_MODE_HIBERNATE_RAM)
static cy_en_syspm_hibernate_wakeup_source_t _hibernate_wakeup_source = CY_SYSPM_HIBERNATE_WDT0;

//--------------------------------------------------------------------------------------------------
// cyabs_rtos_set_hibernate_wakeup_source
//--------------------------------------------------------------------------------------------------
/** Sets the wakeup source for hibernate mode.
 *
 * Configures which wakeup source will be used to wake the device from hibernate mode.
 * This setting is applied when the device enters hibernation through the RTOS idle task.
 * The default wakeup source is the Watchdog Timer (CY_SYSPM_HIBERNATE_WDT0).
 *
 * @param[in] source    The wakeup source to use for hibernation. This should be one of the
 *                      cy_en_syspm_hibernate_wakeup_source_t enumeration values.
 *
 *
 * @see cyabs_rtos_get_hibernate_wakeup_source
 */
void cyabs_rtos_set_hibernate_wakeup_source(cy_en_syspm_hibernate_wakeup_source_t source)
{
    _hibernate_wakeup_source = source;
}


//--------------------------------------------------------------------------------------------------
// cyabs_rtos_get_hibernate_wakeup_source
//--------------------------------------------------------------------------------------------------
/** Retrieves the currently configured wakeup source for hibernate mode.
 *
 * Returns the wakeup source that is currently set to wake the device from hibernation.
 * This allows the application to verify the current hibernation configuration.
 *
 * @return The configured wakeup source as a cy_en_syspm_hibernate_wakeup_source_t value.
 *
 * @see cyabs_rtos_set_hibernate_wakeup_source
 */
cy_en_syspm_hibernate_wakeup_source_t cyabs_rtos_get_hibernate_wakeup_source(void)
{
    return _hibernate_wakeup_source;
}


#endif // defined(CY_CFG_PWR_MODE_HIBERNATE_RAM)


//--------------------------------------------------------------------------------------------------
// cyabs_rtos_set_lptimer
//--------------------------------------------------------------------------------------------------
void cyabs_rtos_set_lptimer(mtb_hal_lptimer_t* timer)
{
    lptimer = timer;
}


//--------------------------------------------------------------------------------------------------
// cyabs_rtos_get_lptimer
//--------------------------------------------------------------------------------------------------
mtb_hal_lptimer_t* cyabs_rtos_get_lptimer(void)
{
    return lptimer;
}


#if (configUSE_TICKLESS_IDLE != 0)
//--------------------------------------------------------------------------------------------------
// cyabs_rtos_get_deepsleep_latency
//--------------------------------------------------------------------------------------------------
uint32_t cyabs_rtos_get_deepsleep_latency(void)
{
    uint32_t latency = 0U;

    #if defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
    latency = CY_CFG_PWR_DEEPSLEEP_LATENCY;
    #endif //defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)

    #if defined (MTB_HAL_API_AVAILABLE_SYSPM_GET_DEEPSLEEP_MODE)
    mtb_hal_syspm_system_deep_sleep_mode_t deep_sleep_mode = mtb_hal_syspm_get_deepsleep_mode();

    switch (deep_sleep_mode)
    {
        case MTB_HAL_SYSPM_SYSTEM_DEEPSLEEP:
        case MTB_HAL_SYSPM_SYSTEM_DEEPSLEEP_OFF:
        case MTB_HAL_SYSPM_SYSTEM_DEEPSLEEP_NONE:
            #if defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            latency = CY_CFG_PWR_DEEPSLEEP_LATENCY;
            #endif //defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            break;

        case MTB_HAL_SYSPM_SYSTEM_DEEPSLEEP_RAM:
            #if defined(CY_CFG_PWR_DEEPSLEEP_RAM_LATENCY)
            latency = CY_CFG_PWR_DEEPSLEEP_RAM_LATENCY;
            #endif //defined(CY_CFG_PWR_DEEPSLEEP_RAM_LATENCY)
            break;

        default:
            #if defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            latency = CY_CFG_PWR_DEEPSLEEP_LATENCY;
            #endif //defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            break;
    }
    #endif // if defined (MTB_HAL_API_AVAILABLE_SYSPM_GET_DEEPSLEEP_MODE)
    return latency;
}


#endif //(configUSE_TICKLESS_IDLE != 0)
#endif // defined(MTB_HAL_DRIVER_AVAILABLE_LPTIMER) && (MTB_HAL_DRIVER_AVAILABLE_LPTIMER)
#else // (HAL API <= 2.0)
#if defined(CYHAL_DRIVER_AVAILABLE_LPTIMER) && (CYHAL_DRIVER_AVAILABLE_LPTIMER)
static cyhal_lptimer_t* lptimer = NULL;

//--------------------------------------------------------------------------------------------------
// cyabs_rtos_set_lptimer
//--------------------------------------------------------------------------------------------------
void cyabs_rtos_set_lptimer(cyhal_lptimer_t* timer)
{
    lptimer = timer;
}


//--------------------------------------------------------------------------------------------------
// cyabs_rtos_get_lptimer
//--------------------------------------------------------------------------------------------------
cyhal_lptimer_t* cyabs_rtos_get_lptimer(void)
{
    return lptimer;
}


#if (configUSE_TICKLESS_IDLE != 0)
//--------------------------------------------------------------------------------------------------
// cyabs_rtos_get_deepsleep_latency
//--------------------------------------------------------------------------------------------------
uint32_t cyabs_rtos_get_deepsleep_latency(void)
{
    uint32_t latency = 0U;

    #if defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
    latency = CY_CFG_PWR_DEEPSLEEP_LATENCY;
    #endif //defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)

    #if defined (CYHAL_API_AVAILABLE_SYSPM_GET_DEEPSLEEP_MODE)
    cyhal_syspm_system_deep_sleep_mode_t deep_sleep_mode = cyhal_syspm_get_deepsleep_mode();

    switch (deep_sleep_mode)
    {
        case CYHAL_SYSPM_SYSTEM_DEEPSLEEP:
        case CYHAL_SYSPM_SYSTEM_DEEPSLEEP_OFF:
        case CYHAL_SYSPM_SYSTEM_DEEPSLEEP_NONE:
            #if defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            latency = CY_CFG_PWR_DEEPSLEEP_LATENCY;
            #endif //defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            break;

        case CYHAL_SYSPM_SYSTEM_DEEPSLEEP_RAM:
            #if defined(CY_CFG_PWR_DEEPSLEEP_RAM_LATENCY)
            latency = CY_CFG_PWR_DEEPSLEEP_RAM_LATENCY;
            #endif //defined(CY_CFG_PWR_DEEPSLEEP_RAM_LATENCY)
            break;

        default:
            #if defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            latency = CY_CFG_PWR_DEEPSLEEP_LATENCY;
            #endif //defined(CY_CFG_PWR_DEEPSLEEP_LATENCY)
            break;
    }
    #endif // if defined (CYHAL_API_AVAILABLE_SYSPM_GET_DEEPSLEEP_MODE)
    return latency;
}


#endif //(configUSE_TICKLESS_IDLE != 0)
#endif //defined(CYHAL_DRIVER_AVAILABLE_LPTIMER) && (CYHAL_DRIVER_AVAILABLE_LPTIMER)
#endif //defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)

//--------------------------------------------------------------------------------------------------
// cyabs_rtos_get_sleep_latency
//--------------------------------------------------------------------------------------------------
uint32_t cyabs_rtos_get_sleep_latency(void)
{
    #if defined(CY_CFG_PWR_SLEEP_LATENCY)
    return CY_CFG_PWR_SLEEP_LATENCY;
    #else
    return 0U;
    #endif
}


