zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_freertos_helpers.c
CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.4", 1,
                             "vApplicationGetIdleTaskMemory is a FreeRTOS hook; prototype is in FreeRTOS internal headers not visible here.");
//--------------------------------------------------------------------------------------------------
// vApplicationGetIdleTaskMemory
//
// configSUPPORT_STATIC_ALLOCATION is set to 1, so the application must provide an implementation of
// vApplicationGetIdleTaskMemory() to provide the memory that is used by the Idle task.
//--------------------------------------------------------------------------------------------------
__WEAK void vApplicationGetIdleTaskMemory(StaticTask_t** ppxIdleTaskTCBBuffer,
                                          StackType_t** ppxIdleTaskStackBuffer,
                                          uint32_t* pulIdleTaskStackSize)
{
    // If the buffers to be provided to the Idle task are declared inside this function then they
    // must be declared static - otherwise they will be allocated on the stack and so not exists
    // after this function exits.
    static StaticTask_t xIdleTaskTCB;
    CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                                 "Idle task stack buffer must remain writable because FreeRTOS updates stack contents at runtime.");
    static StackType_t  uxIdleTaskStack[configMINIMAL_STACK_SIZE];
    CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");

    // Pass out a pointer to the StaticTask_t structure in which the Idle task's state will be
    // stored.
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    // Pass out the array that will be used as the Idle task's stack.
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    // Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.  Note that, as the
    // array is necessarily of type StackType_t, configMINIMAL_STACK_SIZE is specified in words, not
    // bytes.
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.4");


/*--------------------*/

CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.4", 1,
                             "vApplicationGetTimerTaskMemory is a FreeRTOS hook; prototype is in FreeRTOS internal headers not visible here.");
//--------------------------------------------------------------------------------------------------
// vApplicationGetTimerTaskMemory
//
// configSUPPORT_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the application must
// provide an implementation of vApplicationGetTimerTaskMemory() to provide the memory that is used
// by the Timer service task.
//--------------------------------------------------------------------------------------------------
__WEAK void vApplicationGetTimerTaskMemory(StaticTask_t** ppxTimerTaskTCBBuffer,
                                           StackType_t** ppxTimerTaskStackBuffer,
                                           uint32_t* pulTimerTaskStackSize)
{
    // If the buffers to be provided to the Timer task are declared inside this function then they
    // must be declared static - otherwise they will be allocated on the stack and so not exists
    // after this function exits.
    static StaticTask_t xTimerTaskTCB;
    CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.13", 1,
                                 "Timer task stack buffer must remain writable because FreeRTOS updates stack contents at runtime.");
    static StackType_t  uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];
    CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.13");

    // Pass out a pointer to the StaticTask_t structure in which the Timer task's state will be
    // stored.
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    // Pass out the array that will be used as the Timer task's stack.
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    // Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.  Note that, as the
    // array is necessarily of type StackType_t, configTIMER_TASK_STACK_DEPTH is specified in words,
    // not bytes.
    CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 10.4", 1,
                                 "configTIMER_TASK_STACK_DEPTH macro expansion mixes unsigned and signed operands.");
    const uint32_t timer_task_stack_depth = configTIMER_TASK_STACK_DEPTH;
    CY_MISRA_BLOCK_END("MISRA C-2012 Rule 10.4");
    *pulTimerTaskStackSize = timer_task_stack_depth;
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.4");


#if (configUSE_TICKLESS_IDLE != 0)
CY_MISRA_DEVIATE_BLOCK_START("MISRA C-2012 Rule 8.4", 1,
                             "vApplicationSleep is a FreeRTOS hook; prototype is in FreeRTOS internal headers not visible here.");
//--------------------------------------------------------------------------------------------------
// vApplicationSleep
//
/** User defined tickless idle sleep function.
 *
 * Provides a implementation for portSUPPRESS_TICKS_AND_SLEEP macro that allows
 * the device to attempt to deep-sleep for the idle time the kernel expects before
 * the next task is ready. This function disables the system timer and enables low power
 * timer that can operate in deep-sleep mode to wake the device from deep-sleep after
 * expected idle time has elapsed.
 *
 * @param[in] xExpectedIdleTime    Total number of tick periods before
 *                                  a task is due to be moved into the Ready state.
 */
//--------------------------------------------------------------------------------------------------
__WEAK void vApplicationSleep(TickType_t xExpectedIdleTime)
{
    #if defined(ABS_RTOS_TICKLESS_ENABLED)
    uint32_t actual_idle_ms = 0U;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    bool wfi_at_end = false;
    // The application is expected to populate this value by calling
    // `cyabs_rtos_set_lptimer` before the RTOS scheduler is started
    #if !(defined(MTB_HAL_API_VERSION)) || (MTB_HAL_API_VERSION < 3)
    if (NULL == cyabs_rtos_get_lptimer())
    {
        static cyhal_lptimer_t timer;
        result = cyhal_lptimer_init(&timer);
        if (result == CY_RSLT_SUCCESS)
        {
            lptimer = &timer;
        }
        else
        {
            CY_ASSERT(false);
        }
    }
    #endif // !defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)

