zhanzr/cy8ckit-demo/app/mtb_shared/abstraction-rtos/release-v1.13.0/source/COMPONENT_FREERTOS/cyabs_freertos_helpers.c
    if (NULL != cyabs_rtos_get_lptimer())
    {
        /* Disable interrupts so that nothing can change the status of the RTOS while
         * we try to go to sleep or deep-sleep.
         */
        uint32_t interrupt_status = cyhal_system_critical_section_enter();
        eSleepModeStatus sleep_status = eTaskConfirmSleepModeStatus();

        if (sleep_status != (eSleepModeStatus)eAbortSleep)
        {
            // If the RTOS says we should sleep, we should WFI at the end of this function unless
            // something else attempts to enter a tickless sleep
            // Note, this is *attempts*, not *succeeds*.  If we determined that we should try to
            // enter tickless, but failed to do so, we want to stay awake and let the RTOS call
            // back into us again if there is time. It is possible that a low power transition
            // is prevented by a transient hardware condition (e.g. a UART not quite done sending)
            // that may resolved itself before a subsequent try.
            wfi_at_end = true;

            uint32_t requested_idle_ms = pdTICKS_TO_MS(xExpectedIdleTime);
            uint32_t sleep_latency = cyabs_rtos_get_sleep_latency();

            #if defined(ABS_RTOS_DEEPSLEEP_ENABLED)
            uint32_t deep_sleep_latency = cyabs_rtos_get_deepsleep_latency();
            if (requested_idle_ms > deep_sleep_latency)
            {
                wfi_at_end = false;
                #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                #if defined(CY_CFG_PWR_MODE_HIBERNATE_RAM)
                if (CY_CFG_PWR_SYS_IDLE_MODE == CY_CFG_PWR_MODE_HIBERNATE_RAM)
                {
                    result = mtb_hal_syspm_tickless_hibernate_ram(
                        cyabs_rtos_get_lptimer(), cyabs_rtos_get_hibernate_wakeup_source(),
                        (requested_idle_ms -
                         deep_sleep_latency),
                        &actual_idle_ms);
                }
                else
                #endif // defined(CY_CFG_PWR_MODE_HIBERNATE_RAM)
                {
                    result = mtb_hal_syspm_tickless_deepsleep(cyabs_rtos_get_lptimer(),
                                                              (requested_idle_ms -
                                                               deep_sleep_latency),
                                                              &actual_idle_ms);
                }
                #else // if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                result = cyhal_syspm_tickless_deepsleep(cyabs_rtos_get_lptimer(),
                                                        (requested_idle_ms - deep_sleep_latency),
                                                        &actual_idle_ms);
                #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                #if defined(MTB_HAL_SYSPM_RSLT_DEEPSLEEP_LOCKED) || \
                defined(CYHAL_SYSPM_RSLT_DEEPSLEEP_LOCKED)
                #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                if (MTB_HAL_SYSPM_RSLT_DEEPSLEEP_LOCKED == result)
                #else
                if (CYHAL_SYSPM_RSLT_DEEPSLEEP_LOCKED == result)
                #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                {
                    // DeepSleep was locked by software. We know that there is no hardware
                    // event that could cause it to be unlocked, and we're in a critical section
                    // so we know that there is no interrupt handler that could unlock it.
                    // So in this specific case, we can safely infer that the most power-efficient
                    // action is to enter Sleep for the entire idle period.
                    if (requested_idle_ms > sleep_latency)
                    {
                        result =
                            #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                            mtb_hal_syspm_tickless_sleep(
                                cyabs_rtos_get_lptimer(), (requested_idle_ms - sleep_latency),
                                &actual_idle_ms);
                            #else
                            cyhal_syspm_tickless_sleep(
                                cyabs_rtos_get_lptimer(), (requested_idle_ms - sleep_latency),
                                &actual_idle_ms);
                        #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                    }
                }
                #else // if defined(MTB_HAL_SYSPM_RSLT_DEEPSLEEP_LOCKED) ||
                // defined(CYHAL_SYSPM_RSLT_DEEPSLEEP_LOCKED)
                CY_UNUSED_PARAMETER(sleep_latency);
                #endif // defined(MTB_HAL_SYSPM_RSLT_DEEPSLEEP_LOCKED)
            }
            #endif // defined(ABS_RTOS_DEEPSLEEP_ENABLED)
            #if defined(ABS_RTOS_SLEEP_ENABLED)
            #if defined(ABS_RTOS_DEEPSLEEP_ENABLED)
            // If we tried to DeepSleep, we don't want to also try to sleep. Either we
            // went to DeepSleep and then were woken by an interrupt (possibly prematurely),
            // or we tried to DeepSleep and were rejected by hardware not being ready
            // (which might now be ready if we try DeepSleep again). In either of those cases,
            // we should not also try to enter Sleep; we should return from this function
            // and let the RTOS scheduler sort out whether to call us again.
            else
            #endif // defined(ABS_RTOS_DEEPSLEEP_ENABLED)
            if (requested_idle_ms > sleep_latency)
            {
                wfi_at_end = false;
                #if defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
                result = mtb_hal_syspm_tickless_sleep(
                    cyabs_rtos_get_lptimer(), (requested_idle_ms - sleep_latency),
                    &actual_idle_ms);
                #else
                result = cyhal_syspm_tickless_sleep(
                    cyabs_rtos_get_lptimer(), (requested_idle_ms - sleep_latency),
                    &actual_idle_ms);
                #endif // defined(MTB_HAL_API_VERSION) && ((MTB_HAL_API_VERSION) >= 3)
            }
            #endif // if defined(ABS_RTOS_SLEEP_ENABLED)

            CY_UNUSED_PARAMETER(result);
            // The return value of tickless sleep is disregarded since SysTick timer is stopped,
            // before sleep, regardless of the sleep's success or failure, therefore idle time
            // must be updated in any case.
            if (actual_idle_ms > 0U)
            {
                // If you hit this assert, the latency time (CY_CFG_PWR_DEEPSLEEP_LATENCY) should
                // be increased. This can be set though the Device Configurator, or by manually
                // defining the variable in cybsp.h for the TARGET platform.
                CY_ASSERT(actual_idle_ms <= pdTICKS_TO_MS(xExpectedIdleTime));
                vTaskStepTick(convert_ms_to_ticks(actual_idle_ms));
            }
        }
        cyhal_system_critical_section_exit(interrupt_status);
    }
    else
    {
        /* If LPtimer is not defined, only do a WFI to preserve compatibility */
        wfi_at_end = true;
    }

    if (true == wfi_at_end)
    #else // defined(ABS_RTOS_TICKLESS_ENABLED)
    CY_UNUSED_PARAMETER(xExpectedIdleTime);
    #endif // defined(ABS_RTOS_TICKLESS_ENABLED)
    {
        __WFI();
    }
}


CY_MISRA_BLOCK_END("MISRA C-2012 Rule 8.4");


#endif // (configUSE_TICKLESS_IDLE != 0)
